tap "anomalyco/tap"
tap "chase/tap"
tap "lihaoyun6/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
brew "act"
brew "agent-browser"
brew "antidote"
brew "aria2"
brew "awscli"
brew "bacon"
brew "bash"
brew "bat"
brew "beads"
brew "chezmoi"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "duckdb"
brew "eza"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "firebase-cli"
brew "fx"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitingest"
brew "glow"
brew "gnupg"
brew "go"
brew "graphviz"
brew "helix"
brew "httpie"
brew "hyperfine"
brew "jupyterlab"
brew "just"
brew "lazygit"
brew "mongosh"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "poppler"
brew "powershell", link: false
brew "pyenv"
brew "qrencode"
brew "rtk"
brew "sem-cli"
brew "terminal-notifier"
brew "thefuck"
brew "tmate"
brew "tree"
brew "xcodes"
brew "zellij"
brew "anomalyco/tap/opencode"
brew "chase/tap/awrit"
brew "mongodb/brew/mongodb-database-tools"
cask "1password"
cask "1password-cli"
cask "lihaoyun6/tap/airbattery"
cask "alcove"
cask "athas"
cask "bruno"
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "cyberduck"
cask "datagrip"
cask "discord"
cask "figma-agent"
cask "gcloud-cli"
cask "ghostty@tip"
cask "google-chrome"
cask "handy"
cask "httpie-desktop"
cask "jordanbaird-ice@beta"
cask "karabiner-elements"
cask "keka"
cask "kekaexternalhelper"
cask "kitlangton-hex"
cask "lm-studio"
cask "logi-options+"
cask "lunar"
cask "macmediakeyforwarder"
cask "obsidian"
cask "opencode-desktop"
cask "orbstack"
cask "powershell"
cask "protonvpn"
cask "raycast"
cask "sony-ps-remote-play"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zed@preview"
cask "zen"
vscode "1yib.rust-bundle"
vscode "a-h.templ"
vscode "acrylic.acrylic-dark-theme"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alexanderte.dainty-vscode"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "andrejunges.handlebars"
vscode "andrsdc.base16-themes"
vscode "angular.ng-template"
vscode "annalifatou.minimal-wave"
vscode "antfu.goto-alias"
vscode "antfu.theme-vitesse"
vscode "antfu.unocss"
vscode "anweber.vscode-httpyac"
vscode "ariga.atlas-hcl"
vscode "arrrrny.zed-one-theme"
vscode "arthur-fontaine.vscode-autotyper"
vscode "artlaman.chalice-color-theme"
vscode "artlaman.chalice-icon-theme"
vscode "astro-build.astro-vscode"
vscode "attilah.ohm"
vscode "be5invis.theme-verdandi"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "benbusby.earthbound-themes"
vscode "better-ts-errors.better-ts-errors"
vscode "bierner.comment-tagged-templates"
vscode "bierner.github-markdown-preview"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bilawal-hameed.vscode-stockholm-theme"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "carlos-rgl.material-gecko"
vscode "casualjim.gotemplate"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cdonohue.polychrome-vscode-themes"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "cocopon.iceberg-theme"
vscode "cr-jr.chronotype-vscode-themes"
vscode "crystal-lang-tools.crystal-lang"
vscode "davidanson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "divanvisagie.nord-native-theme"
vscode "docker.docker"
vscode "dotenv.dotenv-vscode"
vscode "dprint.dprint"
vscode "drcika.apc-extension"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emily-curry.base16-tomorrow-dark-vscode"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "figma.kiwi-message-format"
vscode "fill-labs.dependi"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "frizadiga.friza-dark"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "greven.umbra"
vscode "gruntfuggly.todo-tree"
vscode "gsakkas.gruvbox-mix"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "hashicorp.hcl"
vscode "haskell.haskell"
vscode "hemlok.framer-dark"
vscode "homerotto.themin"
vscode "hoovercj.vscode-settings-cycler"
vscode "huacat.office-theme"
vscode "huytd.nord-light"
vscode "hverlin.mise-vscode"
vscode "icrawl.discord-vscode"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jock.svg"
vscode "jtlowe.vscode-icon-theme"
vscode "justusadam.language-haskell"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kylpo.vscode-find-in-files-with-selection"
vscode "lambdastudio.lambda-studio-themes"
vscode "langium.langium-vscode"
vscode "lehoanganh298.json-lines-viewer"
vscode "leonardssh.vscord"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "lokalise.i18n-ally"
vscode "luongnd.edge"
vscode "m-thorsen.vscode-materia"
vscode "magicstack.edgedb"
vscode "mateocerquetella.xcode-12-theme"
vscode "mathiasfrohlich.kotlin"
vscode "matthewpi.caddyfile-support"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "merithayan.polar"
vscode "mhutchie.git-graph"
vscode "michaelzhou.fleet-theme"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikelward.theme-plainlight"
vscode "modular-mojotools.vscode-mojo"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vsliveshare.vsliveshare"
vscode "mustafamohamad.min-tomorrow-theme"
vscode "mvllow.rose-pine"
vscode "mylesmurphy.prettify-ts"
vscode "ngryman.codesandbox-theme"
vscode "nicohlr.pycharm"
vscode "nyomansunima.boola"
vscode "o4x.base16-tomorrow"
vscode "onecentlin.laravel5-snippets"
vscode "openai.chatgpt"
vscode "origamid.origamid-next"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "paulera.paulerathemes"
vscode "ph-hawkins.arc-plus"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pmndrs.pmndrs"
vscode "prisma.prisma"
vscode "pulsebyte.pulsebyte"
vscode "raunofreiberg.vesper"
vscode "reagankarnes.one-material-dark"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "robertrossmann.remedy"
vscode "rust-lang.rust-analyzer"
vscode "ryan0x200.kaia-theme-vscode"
vscode "ryuta46.multi-command"
vscode "sainnhe.gruvbox-material"
vscode "sallar.vscode-duotone-dark"
vscode "samuelcolvin.jinjahtml"
vscode "sapegin.theme-squirrelsonglight"
vscode "sdras.night-owl"
vscode "sentientcoffee.dark-coffee-theme"
vscode "serayuzgur.crates"
vscode "shadowblood.tailwind-moon"
vscode "simonsiefke.svg-preview"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "subframe7536.custom-ui-style"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thenouillet.symfony-vscode"
vscode "thiagolciobittencourt.ubuntuvscode"
vscode "thompsonbrian.improved-minimal-theme"
vscode "tinkertrain.theme-panda"
vscode "tomoki1207.pdf"
vscode "trongthanh.theme-boxythemekit"
vscode "typespec.typespec-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wheredoesyourmindgo.nushu-vscode-theme"
vscode "whitebird.kaz-vscode"
vscode "wholroyd.jinja"
vscode "wicked-labs.wvsc-serendipity"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
vscode "ziterz.codesandbox-black-theme"
vscode "zxh404.vscode-proto3"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
cargo "cargo-xwin"
cargo "wrkflw"
