mattmc3/ez-compinit kind:defer
zsh-users/zsh-completions kind:defer

mattmc3/zshrc.d

romkatv/powerlevel10k

Aloxaf/fzf-tab kind:defer
zsh-users/zsh-autosuggestions kind:defer

MichaelAquilina/zsh-autoswitch-virtualenv

zdharma-continuum/fast-syntax-highlighting kind:defer
agkozak/zsh-z kind:defer
zsh-users/zsh-history-substring-search kind:defer
